from dataclasses import dataclass, field
from typing import List


@dataclass
class Config:
    round_decimal: int = field(default=3)
    sampling_frequency: float = field(default=4096)
    channel_head_count: int = field(default=10)
    init_channel_count: int = field(default=10)
    default_colors: List[str] = field(default_factory=lambda: [
        "red", "green", "blue", "orange",
        "purple", "brown", "gray", "cyan", "magenta",
        "lime", "olive", "teal", "maroon", "navy", "silver", "gold", "violet", "yellow" "pink"
    ])
    curve = {'B2': [(10, 40, 100, 500, 2000), (0.003, 0.003, 0.0005, 0.0005, 0.00032)],
             'B': [(10, 40, 100, 500, 2000), (0.012, 0.012, 0.02, 0.02, 0.00013)],
             'B3': [(10, 31, 100, 500, 2000), (0.02, 0.02, 0.02, 0.02, 0.00013)],
             'C': [(10, 40, 54.7, 500, 2000), (0.012, 0.012, 0.02, 0.02, 0.00126)],
             'D': [(10, 28, 40, 250, 500, 2000), (0.02, 0.02, 0.04, 0.04, 0.08, 0.02)],
             'E': [(10, 28, 40, 100, 250, 500, 2000), (0.02, 0.02, 0.04, 0.04, 0.08, 0.08, 0.00505)]}

    zone = {
        'А1 - Полетные режимы': [(10, 50, 2000), (0.002, 0.01, 0.01)],
        'А1 - Взлет/Посадка': [(10, 50, 50.1, 2000), (0.05, 0.05, 0.005, 0.005)],
        'А - Полетные режимы': [(10, 50, 2000), (0.002, 0.01, 0.01)],
        'А - Взлет/Посадка': [(10, 50, 50.1, 2000), (0.02, 0.02, 0.005, 0.005)],
        'Б - Полетные режимы': [(10, 50, 50.1, 2000), (0.005, 0.005, 0.02, 0.02)],
        'Б - Взлет/Посадка': [(10, 50, 50.1, 2000), (0.02, 0.02, 0.05, 0.05)],
        'В - Полетные режимы': [(10, 20, 50, 150, 2000), (0.0025, 0.01, 0.01, 0.0002, 0.00126)],
        'В - Взлет/Посадка': [(10, 20, 50, 150, 160, 2000), (0.012, 0.012, 0.02, 0.02, 0.00126)],
        'Г - Полетные режимы': [(10, 50, 160, 2000), (0.02, 0.02, 0.04, 0.04, 0.08, 0.02)],
        'Г - Взлет/Посадка': [(10, 50, 160, 2000), (0.02, 0.02, 0.04, 0.04, 0.08, 0.02)],
        'Д - Полетные режимы': [(10, 500, 2000), (0.02, 0.02, 0.04, 0.04, 0.08, 0.08, 0.00505)],
        'Д - Взлет/Посадка': [(10, 500, 2000), (0.02, 0.02, 0.04, 0.04, 0.08, 0.08, 0.00505)],
        'Ж - Полетные режимы': [(10, 20, 2000), (0.02, 0.02, 0.04, 0.04, 0.08, 0.02)],
        'Ж - Взлет/Посадка': [(10, 20, 2000), (0.02, 0.02, 0.04, 0.04, 0.08, 0.02)],
        'Е - Полетные режимы': [(10, 50, 2000), (0.02, 0.02, 0.04, 0.04, 0.08, 0.08, 0.00505)],
        'Е - Взлет/Посадка': [(10, 50, 2000), (0.02, 0.02, 0.04, 0.04, 0.08, 0.08, 0.00505)]
}